reports/333-swift-zewo.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 3.247ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.246ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 7.983ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.89ms    7.81ms 100.99ms   94.45%
    Req/Sec     3.43k     0.94k    6.53k    67.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.60ms
 75.000%    7.88ms
 90.000%   11.55ms
 99.000%   46.30ms
 99.900%   76.29ms
 99.990%   91.90ms
 99.999%   99.78ms
100.000%  101.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.118     0.000000            2         1.00
       0.968     0.100000        49532         1.11
       1.397     0.200000        98911         1.25
       1.849     0.300000       148408         1.43
       2.485     0.400000       197795         1.67
       3.599     0.500000       247253         2.00
       4.327     0.550000       271988         2.22
       5.103     0.600000       296746         2.50
       5.959     0.650000       321392         2.86
       6.887     0.700000       346144         3.33
       7.883     0.750000       370909         4.00
       8.431     0.775000       383333         4.44
       8.983     0.800000       395620         5.00
       9.559     0.825000       407992         5.71
      10.143     0.850000       420346         6.67
      10.799     0.875000       432741         8.00
      11.159     0.887500       438808         8.89
      11.551     0.900000       445065        10.00
      11.983     0.912500       451169        11.43
      12.519     0.925000       457358        13.33
      13.199     0.937500       463524        16.00
      13.655     0.943750       466644        17.78
      14.263     0.950000       469706        20.00
      15.215     0.956250       472792        22.86
      17.055     0.962500       475890        26.67
      20.607     0.968750       478974        32.00
      23.039     0.971875       480507        35.56
      25.423     0.975000       482057        40.00
      27.967     0.978125       483603        45.71
      31.119     0.981250       485149        53.33
      35.455     0.984375       486695        64.00
      38.239     0.985938       487461        71.11
      41.407     0.987500       488234        80.00
      44.351     0.989062       489006        91.43
      47.679     0.990625       489780       106.67
      51.071     0.992188       490555       128.00
      52.703     0.992969       490937       142.22
      54.431     0.993750       491323       160.00
      56.255     0.994531       491711       182.86
      58.367     0.995313       492094       213.33
      60.703     0.996094       492485       256.00
      62.015     0.996484       492675       284.44
      63.327     0.996875       492866       320.00
      65.183     0.997266       493060       365.71
      67.391     0.997656       493254       426.67
      69.631     0.998047       493448       512.00
      70.975     0.998242       493544       568.89
      72.319     0.998437       493639       640.00
      73.727     0.998633       493736       731.43
      75.263     0.998828       493837       853.33
      76.543     0.999023       493930      1024.00
      77.631     0.999121       493979      1137.78
      78.591     0.999219       494025      1280.00
      79.935     0.999316       494075      1462.86
      81.151     0.999414       494126      1706.67
      82.431     0.999512       494172      2048.00
      82.943     0.999561       494197      2275.56
      84.223     0.999609       494220      2560.00
      84.799     0.999658       494248      2925.71
      85.567     0.999707       494267      3413.33
      86.783     0.999756       494292      4096.00
      87.551     0.999780       494303      4551.11
      89.663     0.999805       494315      5120.00
      90.559     0.999829       494327      5851.43
      91.135     0.999854       494339      6826.67
      91.519     0.999878       494352      8192.00
      91.647     0.999890       494357      9102.22
      91.967     0.999902       494364     10240.00
      92.799     0.999915       494369     11702.86
      93.375     0.999927       494375     13653.33
      93.823     0.999939       494381     16384.00
      97.663     0.999945       494384     18204.44
      98.559     0.999951       494387     20480.00
      98.879     0.999957       494390     23405.71
      99.071     0.999963       494393     27306.67
      99.263     0.999969       494396     32768.00
      99.391     0.999973       494399     36408.89
      99.391     0.999976       494399     40960.00
      99.519     0.999979       494401     46811.43
      99.583     0.999982       494404     54613.33
      99.583     0.999985       494404     65536.00
      99.711     0.999986       494405     72817.78
      99.711     0.999988       494405     81920.00
      99.775     0.999989       494406     93622.86
     100.159     0.999991       494408    109226.67
     100.159     0.999992       494408    131072.00
     100.159     0.999993       494408    145635.56
     100.159     0.999994       494408    163840.00
     100.287     0.999995       494410    187245.71
     100.287     0.999995       494410    218453.33
     100.287     0.999996       494410    262144.00
     100.287     0.999997       494410    291271.11
     100.287     0.999997       494410    327680.00
     100.287     0.999997       494410    374491.43
     100.287     0.999998       494410    436906.67
     101.055     0.999998       494411    524288.00
     101.055     1.000000       494411          inf
#[Mean    =        5.895, StdDeviation   =        7.811]
#[Max     =      100.992, Total count    =       494411]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  594894 requests in 1.00m, 22.69MB read
Requests/sec:   9911.40
Transfer/sec:    387.16KB