reports/333-swift-zewo.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 2.974ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.944ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.992ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.41ms  627.80us  13.32ms   68.64%
    Req/Sec     3.51k   285.93     6.40k    66.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    1.80ms
 90.000%    2.22ms
 99.000%    2.99ms
 99.900%    4.20ms
 99.990%    9.69ms
 99.999%   12.65ms
100.000%   13.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.110     0.000000            1         1.00
       0.646     0.100000        49517         1.11
       0.862     0.200000        99051         1.25
       1.036     0.300000       148326         1.43
       1.200     0.400000       197984         1.67
       1.362     0.500000       247469         2.00
       1.444     0.550000       272057         2.22
       1.527     0.600000       296652         2.50
       1.614     0.650000       321533         2.86
       1.705     0.700000       346108         3.33
       1.805     0.750000       371013         4.00
       1.859     0.775000       383339         4.44
       1.916     0.800000       395612         5.00
       1.979     0.825000       408063         5.71
       2.049     0.850000       420469         6.67
       2.127     0.875000       432651         8.00
       2.171     0.887500       438901         8.89
       2.217     0.900000       445059        10.00
       2.269     0.912500       451340        11.43
       2.325     0.925000       457516        13.33
       2.391     0.937500       463660        16.00
       2.429     0.943750       466740        17.78
       2.471     0.950000       469828        20.00
       2.517     0.956250       472814        22.86
       2.571     0.962500       475921        26.67
       2.635     0.968750       479013        32.00
       2.671     0.971875       480514        35.56
       2.711     0.975000       482045        40.00
       2.755     0.978125       483598        45.71
       2.805     0.981250       485142        53.33
       2.861     0.984375       486704        64.00
       2.893     0.985938       487475        71.11
       2.929     0.987500       488263        80.00
       2.967     0.989062       489001        91.43
       3.013     0.990625       489776       106.67
       3.067     0.992188       490550       128.00
       3.097     0.992969       490925       142.22
       3.137     0.993750       491324       160.00
       3.185     0.994531       491705       182.86
       3.245     0.995313       492090       213.33
       3.313     0.996094       492471       256.00
       3.355     0.996484       492662       284.44
       3.403     0.996875       492860       320.00
       3.463     0.997266       493056       365.71
       3.547     0.997656       493243       426.67
       3.651     0.998047       493435       512.00
       3.721     0.998242       493532       568.89
       3.797     0.998437       493630       640.00
       3.899     0.998633       493725       731.43
       4.041     0.998828       493821       853.33
       4.223     0.999023       493918      1024.00
       4.351     0.999121       493967      1137.78
       4.507     0.999219       494015      1280.00
       4.767     0.999316       494063      1462.86
       5.323     0.999414       494111      1706.67
       5.563     0.999512       494159      2048.00
       5.867     0.999561       494183      2275.56
       6.347     0.999609       494207      2560.00
       6.719     0.999658       494232      2925.71
       7.155     0.999707       494256      3413.33
       7.595     0.999756       494281      4096.00
       7.811     0.999780       494292      4551.11
       8.119     0.999805       494304      5120.00
       8.463     0.999829       494316      5851.43
       8.911     0.999854       494329      6826.67
       9.295     0.999878       494340      8192.00
       9.543     0.999890       494346      9102.22
       9.719     0.999902       494352     10240.00
       9.855     0.999915       494358     11702.86
       9.975     0.999927       494364     13653.33
      10.311     0.999939       494370     16384.00
      10.463     0.999945       494373     18204.44
      10.839     0.999951       494376     20480.00
      10.903     0.999957       494379     23405.71
      11.335     0.999963       494382     27306.67
      11.479     0.999969       494385     32768.00
      11.711     0.999973       494387     36408.89
      11.799     0.999976       494388     40960.00
      12.303     0.999979       494390     46811.43
      12.327     0.999982       494391     54613.33
      12.511     0.999985       494394     65536.00
      12.511     0.999986       494394     72817.78
      12.511     0.999988       494394     81920.00
      12.647     0.999989       494395     93622.86
      12.767     0.999991       494396    109226.67
      12.935     0.999992       494397    131072.00
      12.935     0.999993       494397    145635.56
      12.935     0.999994       494397    163840.00
      12.959     0.999995       494398    187245.71
      12.959     0.999995       494398    218453.33
      13.263     0.999996       494399    262144.00
      13.263     0.999997       494399    291271.11
      13.263     0.999997       494399    327680.00
      13.263     0.999997       494399    374491.43
      13.263     0.999998       494399    436906.67
      13.327     0.999998       494400    524288.00
      13.327     1.000000       494400          inf
#[Mean    =        1.410, StdDeviation   =        0.628]
#[Max     =       13.320, Total count    =       494400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597342 requests in 1.00m, 22.79MB read
Requests/sec:   9955.54
Transfer/sec:    388.89KB